# Напишите программу, которая принимает
# на вход цифру, обозначающую день недели,
# и проверяет, является ли этот день выходным.
# Пример:
# - 6 -> да
# - 7 -> да
# - 1 -> нет
a = input("Введите номер дня недели: ")
if 5 < int(a) < 8:
    print('Это выходной')
elif 0 < int(a) < 6:
    print('Это не выходной')
else:
    print("Вы не ввели номер дня недели")
